/**
 * 实验室所有的错误提示信息都在这里，不区分是哪个工具，只有errorCode
 * @author zhouyu01
 */

fclab.getFailTip = function(dom, errorcode){
	var container;
	if(container = baidu.g(dom)){
		container.innerHTML = fclab.config.fail[errorcode] || "对不起，出错啦！";
	}
}

fclab.config = fclab.config || {};

fclab.config.fail = {
	"180000": "您今天提交的反馈已达到上限",
	"180010": "该关键词状态不为有效",
	"180011": "该关键词检索量过低",
	"180012": "该关键词已在其他实验中",
	"180014": "该关键词正在使用转化出价工具",
	
	"180020": "您当前设置的实验名称已经存在，建议加入编号区分",
	"180021": "实验名称请控制在30个字符内",
	"180022": "实验持续时长设置有误",
	"180023": "实验流量比例有误",
	"180024": "实验类型有误",
	"180025": "实验关注指标有误",
	"180028": "您添加的关键词过多，请根据上限进行删除",
	"180029": "您当前进行中实验数量已达到上限，我们将为您保存本实验，待有实验结束后您可开启本实验",
	"180030": "实验名称不合法",
	
	//以下是前端提醒，非后台返回errorcode
	"testnamenull": "实验名称不能为空",
	"testwordsupper": "实验对象已达到可添加上限"
}
