/**
 * 一些配置信息
 * 比如最大长度，最小长度之类的
 *
 * 话术和错误信息不要配在这，text.js 和 error.js 会专门做这种事
 *
 * @author zhujialu
 * @update 2012/10/23
 */
fc.common.Config = function() {
    
    // =================================== 账户相关 ===================================
    var ACCOUNT = {
        // 最小预算
		MIN_BUDGET: 50,
        // 最小周预算
		MIN_WEEKBUDGET: 38,
		//高级ip排除的数量
		NUM_ADV_IP_EXCLUDE:3
    };

    // ==================================== 计划相关 ====================================
    var PLAN = {
        // 最小预算
		MIN_BUDGET: 5
    };

    // ===================================== 单元相关 =====================================
    var UNIT = {
        MAX_LENGTH: 30,
        // 所在单元的关键词添加上限数量
        MAX_KEYWORD: 5000
    };

    // ===================================== 关键词相关 ===================================
    var KEYWORD = {
        // 关键词最大长度
        MAX_LENGTH: 40, 
        // 添加关键词时，最多输入的数量
		MAX_INPUT: 100
    };

    // ===================================== 出价 ===========================================
    var BID = {
        MAX: 999.99,
        MIN: 0
    };

    // ===================================== 报告 ===========================================
    var REPORT = {
        // 报告名称最大长度
        MAX_NAME_LENGTH: 50
    };

    return {
        ACCOUNT: ACCOUNT,
        PLAN: PLAN,
        UNIT: UNIT,
        KEYWORD: KEYWORD,
        BID: BID,
        REPORT: REPORT
    };

}();
